Revit 2026 API

# VertexStreamPositionNormalColoredAddVertices Method

---
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddVertices(
	IList<VertexPositionNormalColored> vertices
)
```
```vb
Public Sub AddVertices (
	vertices As IList(Of VertexPositionNormalColored)
)
```
```cpp
public:
void AddVertices(
	IList<VertexPositionNormalColored^>^ vertices
)
```
```fsharp
member AddVertices :
        vertices : IList<VertexPositionNormalColored> -> unit
```

#### Parameters

vertices IListVertexPositionNormalColored

#### Reference

VertexStreamPositionNormalColored Class

Autodesk.Revit.DB.DirectContext3D Namespace